In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [37]:
! pip install tensorflow as tf

Collecting tensorflow
  Downloading tensorflow-2.7.0-cp38-cp38-win_amd64.whl (430.8 MB)

ERROR: Could not find a version that satisfies the requirement as
ERROR: No matching distribution found for as

**Separate on and off rent assets**

In [2]:
# ! pip install kaggle

Requirement already satisfied: kaggle in c:\users\ncarlson\anaconda3\lib\site-packages (1.5.12)
Requirement already satisfied: python-slugify in c:\users\ncarlson\anaconda3\lib\site-packages (from kaggle) (5.0.2)
Requirement already satisfied: certifi in c:\users\ncarlson\anaconda3\lib\site-packages (from kaggle) (2020.12.5)
Requirement already satisfied: six>=1.10 in c:\users\ncarlson\anaconda3\lib\site-packages (from kaggle) (1.15.0)
Requirement already satisfied: tqdm in c:\users\ncarlson\anaconda3\lib\site-packages (from kaggle) (4.59.0)
Requirement already satisfied: requests in c:\users\ncarlson\anaconda3\lib\site-packages (from kaggle) (2.25.1)
Requirement already satisfied: urllib3 in c:\users\ncarlson\anaconda3\lib\site-packages (from kaggle) (1.26.4)
Requirement already satisfied: python-dateutil in c:\users\ncarlson\anaconda3\lib\site-packages (from kaggle) (2.8.1)
Requirement already satisfied: text-unidecode>=1.3 in c:\users\ncarlson\anaconda3\lib\site-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: chardet<5,>=3.0.2 in c:\users\ncarlson\anaconda3\lib\site-packages (from requests->kaggle) (4.0.0)
Requirement already satisfied: idna<3,>=2.5 in c:\users\ncarlson\anaconda3\lib\site-packages (from requests->kaggle) (2.10)

# Dowload dataset

In [9]:
! kaggle competitions download -w Titanic

Downloading Titanic.zip to .

  0%|          | 0.00/34.1k [00:00<?, ?B/s]
100%|##########| 34.1k/34.1k [00:00<00:00, 1.22MB/s]

In [12]:
! dir

 Volume in drive C has no label.
 Volume Serial Number is DE1C-D871

 Directory of C:\Users\ncarlson\Documents\Titanic

12/15/2021  09:17 AM    <DIR>          .
12/15/2021  09:17 AM    <DIR>          ..
12/15/2021  08:55 AM    <DIR>          .ipynb_checkpoints
12/11/2019  02:17 AM             3,258 gender_submission.csv
12/15/2021  08:49 AM                58 README.md
12/11/2019  02:17 AM            28,629 test.csv
12/15/2021  09:17 AM             3,609 Titanic Classifier.ipynb
12/15/2021  09:10 AM            34,877 Titanic.zip
12/11/2019  02:17 AM            61,194 train.csv
               6 File(s)        131,625 bytes
               3 Dir(s)  74,261,618,688 bytes free

In [27]:
test_y = pd.read_csv('gender_submission.csv')
test_y.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [28]:
test_x = pd.read_csv('test.csv')
test_x.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [25]:
train = pd.read_csv('train.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [36]:
train_y = train[['PassengerId', 'Survived']]
train_x = train.drop(labels=['PassengerId', 'Survived'], axis=1)

In [ ]:
train_x